cases/attractor/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    top
    {
        type            wall;
        inGroups        1(wall);
        nFaces          240;
        startFace       76400;
    }
    bottom
    {
        type            wall;
        inGroups        1(wall);
        nFaces          240;
        startFace       76640;
    }
    left
    {
        type            patch;
        nFaces          160;
        startFace       76880;
    }
    right
    {
        type            patch;
        nFaces          160;
        startFace       77040;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          76800;
        startFace       77200;
    }
)

// ************************************************************************* //
