cases/attractor/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   0.01;

vertices
(
    (0      0 0) //0
    (45    0 0) //1
    (60    40 0) //2
    (15      40 0) //3
    (0      0 0.1)//4
    (45    0 0.1)//5
    (60    40 0.1)//6
    (15      40 0.1)//7
);


blocks
(
    hex (0 1 2 3 4 5 6 7) (240 160 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    top
    {
        type wall;
        faces
        (
            (7 3 2 6)
        );
    }
    bottom
    {
        type wall;
        faces
        (
            (4 0 1 5)
        );
    }
    left
    {
        type patch;
        faces
        (
            (4 0 3 7)
        );
    }
    right
    {
        type patch;
        faces
        (
            (1 2 6 5)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 3 2 1)
            (4 7 6 5)
        );
    }
);

mergePatchPairs
(
);


// ************************************************************************* //
